app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes"
---
  def index
    @bikes = Bike.all

INSERT INTO "bikes" ("name", "model_no", "price", "color", "lighting", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "ns-125"], ["model_no", "13"], ["price", "1,30,000"], ["color", "red"], ["lighting", "LED"], ["created_at", "2023-11-27 07:31:27.226715"], ["updated_at", "2023-11-27 07:31:27.226715"]]
---
  def create
    @bike = Bike.new(bike_params)
    if @bike.save

SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_bike
    @bike = Bike.find(params[:id])