app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)
    if @booking.save
---
INSERT INTO "bookings" ("booking_process", "payment_option", "security", "rating", "created_at", "updated_at", "user_id", "bike_id", "start_time", "end_time", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update

    if @booking.update(booking_params)
---
UPDATE "bookings" SET "payment_option" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["payment_option", "online"], ["updated_at", "2023-11-26 06:31:01.864337"], ["id", 1]]

  def destroy

    if @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = ?  [["id", 4]]

  def check_bike_availability

    @bike = Bike.find_by(id:params[:bike_id])
    if @bike.nil?
      render json: { message: 'Bike not found' }
    elsif @bike.bookings.any?
---
SELECT "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."bike_id" = ?  [["bike_id", 4]]
SELECT 1 AS one FROM "bookings" WHERE "bookings"."bike_id" = ? LIMIT ?  [["bike_id", 1], ["LIMIT", 1]]