app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "contact", "dob", "gender", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update

    if @user.update(user_params)
---
UPDATE "users" SET "gender" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["gender", "female"], ["updated_at", "2023-11-26 10:12:15.931608"], ["id", 1]]